#Задача 1. (Конкатенация строк)
# Создайте три переменные:
# str1 = "Авто"
# str2 = "мобиль"
# str3 = "ный"
#
# Объедините эти три строки в одну (в указанном порядке) с помощью операции сложения (+) и сохраните результат в переменную full_word.
# Выведите на экран значение переменной full_word.

str1 = "Авто"

str2 = "мобиль"

str3 = "ный"

full_word = "Авто" + "мобиль" + "ный"

print(full_word)