#Задача 1 (Оператор if)
# Напишите программу, которая просит пользователя ввести число с помощью input(),
# преобразует его в целое число и сохраняет в переменную num.
# Затем, используя оператор if, проверьте: если num больше 10, выведите на экран строку "Число больше десяти."

#num = int(input("Введите число: "))

#if num > 10:
    #print("Число больше десяти.")

#Задача 2(Оператор else)
# Напишите программу, которая просит пользователя ввести свой возраст (целое число) и сохраняет его в переменную age.
# Используя конструкцию if-else, проверьте:
# — Если age больше или равно 18, выведите "Доступ разрешен."
# — Иначе (во всех остальных случаях) выведите "Доступ запрещен."

#age = int(input("Введите свой возраст: "))

#if age >= 18:
    #print("Доступ разрешен.")
#else:
    #print("Доступ запрещен.")

#Задача 3 (Логические операции)
# Даны две переменные: x = True и y = False.
# Напишите код, который выводит на экран результат логической операции ИЛИ (or) между x и y.
# Используйте функцию print() для вывода.

#speed = 343
                                                #Вариант 2
#x = True                                        #x = True

#y = False                                       #y = False

#if(speed <= 400 and x) or y:                    #print(x or y)
    #print("Вы преодолели звуковой барьер")

#Задача 4 (Оператор elif)
# Напишите программу, которая просит пользователя ввести целое число и сохраняет его в переменную number.
# Используя конструкцию if-elif-else, определите и выведите на экран категорию числа:
# — Если number меньше 0, выведите "Отрицательное".
# — Иначе если number равно 0, выведите "Ноль".
# — Иначе (во всех остальных случаях) выведите "Положительное".

#number = int(input("Введите целое число: "))

#if number < 0:
    #print("Отрицательное")

#elif number == 0:
    #print("Ноль")

#else:
    #print("Положительное")






